<a href="https://colab.research.google.com/github/fitriindra/BigDataCourseExamples/blob/master/Tugas4_PySparkDataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **Instalasi Spark pada Google Colab**
kode di bawah ini hanya dijalankan **satu kali saja** saat runtime pertama kali dijalankan

Uncomment code di bawah ini untuk instalasi di Google Colab

In [1]:
#!apt-get install openjdk-8-jdk-headless -qq > /dev/null
#!wget -q http://www-eu.apache.org/dist/spark/spark-2.4.5/spark-2.4.5-bin-hadoop2.7.tgz
#!tar xf spark-2.4.5-bin-hadoop2.7.tgz
#!pip install -q findspark

In [2]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-2.4.5-bin-hadoop2.7"

###**Import Library PySpark**

In [3]:
import findspark
findspark.init("spark-2.4.5-bin-hadoop2.7")# SPARK_HOME
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
sc = spark.sparkContext
spark = SparkSession(sc)

#**Jawaban Soal Tugas 3**

### **2. Bentuk DataFrame menggunakan file dataset yang telah Anda siapkan pada nomor 1. Tampilkan sample 5 data menggunakan fungsi show()**

In [4]:
titanic_df = spark.read.csv("TitanicData.csv", header=True, inferSchema=True)
titanic_df.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund Mr. Owen H...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings Mrs. John...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen Miss. L...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle Mrs. Jac...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen Mr. William...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

### **3. Tampilkan schema atau struktur data pada dataset menggunakan salah satu fungsi actions pada DataFrame**

In [5]:
titanic_df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

### **4. Dengan menggunakan fungsi transformation dan action pada DataFrame, tampilkan penumpang yang berada di kelas (Pclass) 3 saja  dan tampilkan sample 5 data pertama**

In [6]:
titanic_df.filter(titanic_df.Pclass == 3).show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+------+-----+--------+
|          1|       0|     3|Braund Mr. Owen H...|  male|22.0|    1|    0|       A/5 21171|  7.25| null|       S|
|          3|       1|     3|Heikkinen Miss. L...|female|26.0|    0|    0|STON/O2. 3101282| 7.925| null|       S|
|          5|       0|     3|Allen Mr. William...|  male|35.0|    0|    0|          373450|  8.05| null|       S|
|          6|       0|     3|     Moran Mr. James|  male|null|    0|    0|          330877|8.4583| null|       Q|
|          8|       0|     3|Palsson Master. G...|  male| 2.0|    3|    1|          349909|21.075| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+------+-----+--------+
only showing top 5 rows

### **5. Dengan menggunakan fungsi transformation dan action pada DataFrame, tampilkan jumlah penumpang berdasarkan kelas penumpang (Pclass). Hasil akhir berupa jumlah penumpang untuk masing-masing kelas (kelas 1, 2, dan 3)**

In [7]:
titanic_df.groupby("Pclass").count().show()

+------+-----+
|Pclass|count|
+------+-----+
|     1|  216|
|     3|  491|
|     2|  184|
+------+-----+

### **6. Dengan menggunakan fungsi transformation dan action pada DataFrame, tampilkan jumlah penumpang berdasarkan jenis kelamin. Hasil akhir berupa jumlah penumpang untuk masing-masing jenis kelamin (male dan female)**

In [8]:
titanic_df.groupby("Sex").count().show()

+------+-----+
|   Sex|count|
+------+-----+
|female|  314|
|  male|  577|
+------+-----+

### **7. Dengan menggunakan fungsi transformation dan action pada DataFrame, tampilkan jumlah penumpang berdasarkan kelas penumpang dan jenis kelamin. Hasil akhir berupa jumlah penumpang untuk masing-masing kelas penumpang dan jenis kelamin. Pasangan kelas-jenis kelamin:``` 1-female, 1-male, 2-female, 2-male, 3-female, 3-male```**

In [9]:
titanic_df.groupby("Pclass", "Sex").count().show()

+------+------+-----+
|Pclass|   Sex|count|
+------+------+-----+
|     2|female|   76|
|     3|  male|  347|
|     1|  male|  122|
|     3|female|  144|
|     1|female|   94|
|     2|  male|  108|
+------+------+-----+

### **8. Rubahlah kode pada nomor 4 menggunakan Spark SQL dan tampilkan hasil output-nya berupa sample 5 data pertama!**

In [10]:
titanic_df.createOrReplaceTempView("titanic")
spark.sql("SELECT * FROM titanic WHERE Pclass = 3").show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+------+-----+--------+
|          1|       0|     3|Braund Mr. Owen H...|  male|22.0|    1|    0|       A/5 21171|  7.25| null|       S|
|          3|       1|     3|Heikkinen Miss. L...|female|26.0|    0|    0|STON/O2. 3101282| 7.925| null|       S|
|          5|       0|     3|Allen Mr. William...|  male|35.0|    0|    0|          373450|  8.05| null|       S|
|          6|       0|     3|     Moran Mr. James|  male|null|    0|    0|          330877|8.4583| null|       Q|
|          8|       0|     3|Palsson Master. G...|  male| 2.0|    3|    1|          349909|21.075| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+------+-----+--------+
only showing top 5 rows

### **9. Rubahlah kode pada nomor 5 menggunakan Spark SQL**

In [11]:
spark.sql("SELECT Pclass, count(*) FROM titanic GROUP BY Pclass").show()

+------+--------+
|Pclass|count(1)|
+------+--------+
|     1|     216|
|     3|     491|
|     2|     184|
+------+--------+

### **10. Rubahlah kode pada nomor 6 menggunakan Spark SQL dan tampilkan hasil output-nya!**

In [12]:
spark.sql("SELECT Sex, count(*) FROM titanic GROUP BY Sex").show()

+------+--------+
|   Sex|count(1)|
+------+--------+
|female|     314|
|  male|     577|
+------+--------+

### **Soal bonus: Dengan menggunakan operasi-operasi transformations dan actions pada pair RDD, tampilkan jumlah penumpang berjenis kelamin perempuan yang selamat berdasarkan kelasnya**

In [13]:
spark.sql("SELECT PClass, count(*) FROM titanic WHERE Sex = 'female' GROUP BY PClass, Sex").show()

+------+--------+
|PClass|count(1)|
+------+--------+
|     2|      76|
|     3|     144|
|     1|      94|
+------+--------+